with 
okex_pools as(
    SELECT
    address
    FROM
        tag_all
    WHERE 
        tag_name = 'okex_pool'
	group by address
),
bithumb_users as(
    SELECT
    address
    FROM
        tag_all
    WHERE 
        tag_name = 'bithumb'
	group by address
),

-- 查出所有from1在A中的交易（下游地址，时间，金额）
trans_from AS(SELECT
    b.to1,to_char(to_timestamp(b.timestamp::bigint), 'yyyy-mm-dd') AS tx_date, b.transactionhash, b.value 
FROM 
    okex_pools a
    JOIN
    orc_t_ethereum_nmta b 
    ON 
	a.address = b.from1
)
-- 查出所有from1在B中的交易（下游地址，时间，金额）
SELECT
    trans_from.*
    FROM 
    trans_from
	WHERE to1 = '0x1194d33bd19c0680d99ae7160510523207b6cd5d'
;


                    to1                     | date_count | 转币次数 |  max_date  |  min_date  |                 amount                 |  cnt  
--------------------------------------------+------------+----------+------------+------------+----------------------------------------+-------
 0x1194d33bd19c0680d99ae7160510523207b6cd5d |         19 |       50 | 2019-08-18 | 2019-07-12 |                 13941.1720000000000000 |   199
 0x68d7683b4bae4878127ec4f3b39a08d993365e30 |          3 |        4 | 2018-06-22 | 2017-12-04 |                   940.0000000000000000 |    31
 0xe0f8a61748f59cde35dcefc733884435d859da4e |          1 |        1 | 2018-10-25 | 2018-08-28 |                    13.3480000000000000 |    85
 0x4958f31d2f3c72978d60535db88768e798ee0168 |          1 |        1 | 2018-11-29 | 2018-08-20 |                     8.8590000000000000 |    23
 0x4d9ee877ad16a14166ce6a3f248614e5f4943219 |          2 |        2 | 2018-06-24 | 2017-02-25 |                   286.7570000000000000 |   112
 0x366b15bbd6158f457ae3508dc1e28b3e3bd3d352 |          1 |        2 | 2018-06-27 | 2018-01-16 |                 0.04000000000000000000 |    24
 0xe352aa765f4074925b5c6d74b8c477b5af112228 |          8 |        9 | 2019-04-25 | 2018-09-18 |                    81.8900000000000000 |    39
 0x58ab9d5a559acd88faab4164699914a97b3a37eb |          1 |        1 | 2019-01-14 | 2019-01-14 |                 0.08900000000000000000 |     2
 0xc7faca4ce003dca0c106808fdb11324d786625ac |          8 |        9 | 2019-04-08 | 2018-03-06 |                11.43900000000000000000 |    20
 0x1a86a0ceb847e8ded63dfc473b8dda13f2298826 |         13 |       24 | 2020-03-09 | 2019-08-25 |             12670.04700000000000000000 |    46
 0xee36dcc536fbdb6b7745e0a313d33e8bdf2fa788 |          2 |        2 | 2018-06-24 | 2018-01-06 |                 1.68300000000000000000 |     5
 0x21d5558f0ebbdf746bebf4831ce775ebb1044d57 |          1 |        1 | 2018-06-26 | 2018-06-10 |                 0.99000000000000000000 |     3
 0x68b1f32ac91ea2954c4a2e802bb19d389cea4ffd |          2 |        2 | 2018-06-22 | 2017-09-26 |                 2.99000000000000000000 |    74
 0x9404e30dd76f01af3e40b8753fb3a3d627eb3ab5 |          3 |        4 | 2018-06-25 | 2018-03-07 |                   155.7350000000000000 |   247
 0xb10a78de2290942a9c9b2fed921b475ab188f9a1 |          5 |        9 | 2018-06-24 | 2018-01-01 |                    41.3100000000000000 |    19
 0x99a6e344102d8b414c9be291a5da6099fdde722d |          1 |        2 | 2019-04-18 | 2018-08-24 |               143.86400000000000000000 |    65
 0x6c03646de40739992b78ec9050cb3a3c0b68ea8e |          2 |        2 | 2018-06-23 | 2017-09-08 |                    31.9903646100000